package clientServer;

public class Quote {
    private static final String[] quotes = new String[]{
            "У воображения нет границ. У знания есть.",
            "Время вашей жизни ограничено, не тратьте его на жизнь чужой жизнью.",
            "Никто не может заставить вас почувствовать себя неполноценным без вашего согласия.",
            "Тьма не может изгнать тьму: только свет может это сделать. Ненависть не может изгнать ненависть: только любовь может это сделать.",
            "Будь той переменой, которую хочешь видеть в мире.",
            "Будь собой. Все остальные роли уже заняты.",
            "Выберите себе работу по душе, и вам не придется работать ни одного дня в своей жизни.",
            "Успех — это способность идти от поражения к поражению, не теряя энтузиазма",
            "Через двадцать лет вы будете больше разочарованы тем, что не сделали, чем тем, что сделали.",
            "Что разум человека может постигнуть и во что он может поверить, того он способен достичь."
    };

    public static String getRandomQuote() {
        return quotes[(int) (Math.random() * quotes.length)];
    }
}
